Revit 2027 API
CurveOverlapPoint.Type Property
 The type of overlap at the point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveOverlapPointType Type { get; }
Public ReadOnly Property Type As CurveOverlapPointType
	Get
public:
property CurveOverlapPointType Type {
	CurveOverlapPointType get ();
}
member Type : CurveOverlapPointType with get
Property Value
CurveOverlapPointType
See Also
Reference
CurveOverlapPoint Class
Autodesk.Revit.DB Namespace